Heltec-Aaron-Lee/WiFi_Kit_series/esp32/boards.txt
wifi_lora_32.menu.LoRaWanDebugLevel.0=None
wifi_lora_32.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
wifi_lora_32.menu.LoRaWanDebugLevel.1=Freq
wifi_lora_32.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
wifi_lora_32.menu.LoRaWanDebugLevel.2=Freq && DIO
wifi_lora_32.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
wifi_lora_32.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
wifi_lora_32.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3
##############################################################

wifi_lora_32_V2.name=WiFi LoRa 32(V2)

wifi_lora_32_V2.upload.tool=esptool_py
wifi_lora_32_V2.upload.maximum_size=3342336
wifi_lora_32_V2.upload.maximum_data_size=327680
wifi_lora_32_V2.upload.wait_for_upload_port=true

wifi_lora_32_V2.serial.disableDTR=true
wifi_lora_32_V2.serial.disableRTS=true

wifi_lora_32_V2.build.mcu=esp32
wifi_lora_32_V2.build.core=esp32
wifi_lora_32_V2.build.variant=wifi_lora_32_V2
wifi_lora_32_V2.build.board=WIFI_LORA_32_V2

wifi_lora_32_V2.build.f_cpu=240000000L
wifi_lora_32_V2.build.flash_size=8MB
wifi_lora_32_V2.build.flash_freq=80m
wifi_lora_32_V2.build.flash_mode=dio
wifi_lora_32_V2.build.boot=qio
wifi_lora_32_V2.build.partitions=default_8MB
wifi_lora_32_V2.build.defines=

wifi_lora_32_V2.menu.PSRAM.disabled=Disabled
wifi_lora_32_V2.menu.PSRAM.disabled.build.defines=
wifi_lora_32_V2.menu.PSRAM.enabled=Enabled
wifi_lora_32_V2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

wifi_lora_32_V2.menu.CPUFreq.240=240MHz (WiFi/BT)
wifi_lora_32_V2.menu.CPUFreq.240.build.f_cpu=240000000L
wifi_lora_32_V2.menu.CPUFreq.160=160MHz (WiFi/BT)
wifi_lora_32_V2.menu.CPUFreq.160.build.f_cpu=160000000L
wifi_lora_32_V2.menu.CPUFreq.80=80MHz (WiFi/BT)
wifi_lora_32_V2.menu.CPUFreq.80.build.f_cpu=80000000L

wifi_lora_32_V2.menu.UploadSpeed.921600=921600
wifi_lora_32_V2.menu.UploadSpeed.921600.upload.speed=921600
wifi_lora_32_V2.menu.UploadSpeed.115200=115200
wifi_lora_32_V2.menu.UploadSpeed.115200.upload.speed=115200
wifi_lora_32_V2.menu.UploadSpeed.256000.windows=256000
wifi_lora_32_V2.menu.UploadSpeed.256000.upload.speed=256000
wifi_lora_32_V2.menu.UploadSpeed.230400.windows.upload.speed=256000
wifi_lora_32_V2.menu.UploadSpeed.230400=230400
wifi_lora_32_V2.menu.UploadSpeed.230400.upload.speed=230400
wifi_lora_32_V2.menu.UploadSpeed.460800.linux=460800
wifi_lora_32_V2.menu.UploadSpeed.460800.macosx=460800
wifi_lora_32_V2.menu.UploadSpeed.460800.upload.speed=460800
wifi_lora_32_V2.menu.UploadSpeed.512000.windows=512000
wifi_lora_32_V2.menu.UploadSpeed.512000.upload.speed=512000

wifi_lora_32_V2.menu.DebugLevel.none=None
wifi_lora_32_V2.menu.DebugLevel.none.build.code_debug=0
wifi_lora_32_V2.menu.DebugLevel.error=Error
wifi_lora_32_V2.menu.DebugLevel.error.build.code_debug=1
wifi_lora_32_V2.menu.DebugLevel.warn=Warn
wifi_lora_32_V2.menu.DebugLevel.warn.build.code_debug=2
wifi_lora_32_V2.menu.DebugLevel.info=Info
wifi_lora_32_V2.menu.DebugLevel.info.build.code_debug=3
wifi_lora_32_V2.menu.DebugLevel.debug=Debug
wifi_lora_32_V2.menu.DebugLevel.debug.build.code_debug=4
wifi_lora_32_V2.menu.DebugLevel.verbose=Verbose
wifi_lora_32_V2.menu.DebugLevel.verbose.build.code_debug=5

wifi_lora_32_V2.menu.LORAWAN_REGION.0=REGION_EU868
wifi_lora_32_V2.menu.LORAWAN_REGION.0.build.band=REGION_EU868
wifi_lora_32_V2.menu.LORAWAN_REGION.1=REGION_EU433
wifi_lora_32_V2.menu.LORAWAN_REGION.1.build.band=REGION_EU433
wifi_lora_32_V2.menu.LORAWAN_REGION.2=REGION_CN470
wifi_lora_32_V2.menu.LORAWAN_REGION.2.build.band=REGION_CN470
wifi_lora_32_V2.menu.LORAWAN_REGION.3=REGION_US915
wifi_lora_32_V2.menu.LORAWAN_REGION.3.build.band=REGION_US915
wifi_lora_32_V2.menu.LORAWAN_REGION.4=REGION_AU915
wifi_lora_32_V2.menu.LORAWAN_REGION.4.build.band=REGION_AU915
wifi_lora_32_V2.menu.LORAWAN_REGION.5=REGION_CN779
wifi_lora_32_V2.menu.LORAWAN_REGION.5.build.band=REGION_CN779
wifi_lora_32_V2.menu.LORAWAN_REGION.6=REGION_AS923
wifi_lora_32_V2.menu.LORAWAN_REGION.6.build.band=REGION_AS923
wifi_lora_32_V2.menu.LORAWAN_REGION.7=REGION_KR920
wifi_lora_32_V2.menu.LORAWAN_REGION.7.build.band=REGION_KR920
wifi_lora_32_V2.menu.LORAWAN_REGION.8=REGION_IN865
wifi_lora_32_V2.menu.LORAWAN_REGION.8.build.band=REGION_IN865
wifi_lora_32_V2.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
wifi_lora_32_V2.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

wifi_lora_32_V2.menu.LoRaWanDebugLevel.0=None
wifi_lora_32_V2.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
wifi_lora_32_V2.menu.LoRaWanDebugLevel.1=Freq
wifi_lora_32_V2.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
wifi_lora_32_V2.menu.LoRaWanDebugLevel.2=Freq && DIO
wifi_lora_32_V2.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
wifi_lora_32_V2.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
wifi_lora_32_V2.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3
##############################################################

wireless_stick.name=Wireless Stick

wireless_stick.upload.tool=esptool_py
wireless_stick.upload.maximum_size=3342336
wireless_stick.upload.maximum_data_size=327680
wireless_stick.upload.wait_for_upload_port=true

wireless_stick.serial.disableDTR=true
wireless_stick.serial.disableRTS=true

wireless_stick.build.mcu=esp32
wireless_stick.build.core=esp32
wireless_stick.build.variant=wireless_stick
wireless_stick.build.board=WIRELESS_STICK

wireless_stick.build.f_cpu=240000000L
wireless_stick.build.flash_size=8MB
wireless_stick.build.flash_freq=80m
wireless_stick.build.flash_mode=dio
wireless_stick.build.boot=dio
wireless_stick.build.partitions=default_8MB
wireless_stick.build.defines=

wireless_stick.menu.PSRAM.disabled=Disabled
wireless_stick.menu.PSRAM.disabled.build.defines=
wireless_stick.menu.PSRAM.enabled=Enabled
wireless_stick.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

wireless_stick.menu.CPUFreq.240=240MHz (WiFi/BT)
wireless_stick.menu.CPUFreq.240.build.f_cpu=240000000L
wireless_stick.menu.CPUFreq.160=160MHz (WiFi/BT)
wireless_stick.menu.CPUFreq.160.build.f_cpu=160000000L
wireless_stick.menu.CPUFreq.80=80MHz (WiFi/BT)
wireless_stick.menu.CPUFreq.80.build.f_cpu=80000000L

wireless_stick.menu.UploadSpeed.921600=921600
wireless_stick.menu.UploadSpeed.921600.upload.speed=921600
wireless_stick.menu.UploadSpeed.115200=115200
wireless_stick.menu.UploadSpeed.115200.upload.speed=115200
wireless_stick.menu.UploadSpeed.256000.windows=256000
wireless_stick.menu.UploadSpeed.256000.upload.speed=256000
wireless_stick.menu.UploadSpeed.230400.windows.upload.speed=256000
wireless_stick.menu.UploadSpeed.230400=230400
wireless_stick.menu.UploadSpeed.230400.upload.speed=230400
wireless_stick.menu.UploadSpeed.460800.linux=460800
wireless_stick.menu.UploadSpeed.460800.macosx=460800
wireless_stick.menu.UploadSpeed.460800.upload.speed=460800
wireless_stick.menu.UploadSpeed.512000.windows=512000
wireless_stick.menu.UploadSpeed.512000.upload.speed=512000

wireless_stick.menu.DebugLevel.none=None
wireless_stick.menu.DebugLevel.none.build.code_debug=0
wireless_stick.menu.DebugLevel.error=Error
wireless_stick.menu.DebugLevel.error.build.code_debug=1
wireless_stick.menu.DebugLevel.warn=Warn
wireless_stick.menu.DebugLevel.warn.build.code_debug=2
wireless_stick.menu.DebugLevel.info=Info
wireless_stick.menu.DebugLevel.info.build.code_debug=3
wireless_stick.menu.DebugLevel.debug=Debug
wireless_stick.menu.DebugLevel.debug.build.code_debug=4
wireless_stick.menu.DebugLevel.verbose=Verbose
wireless_stick.menu.DebugLevel.verbose.build.code_debug=5

